{
    "skills": [ "Python", "Postgres", "JavaScript", "Streamlit", "React", "HTML", "CSS", "Bash", "Git", "GitHub", "Docker", "Kubernetes", "Terraform"],
    "projects": [
        {
            "name": "SQL Query Web App",
            "url": "",
            "description": "At my current job I worked on a side project to build a graphical interface for our team to quickly make commonly used SQL queries to our database. This was done in Python and I began using the PySimpleGUI library for the GUI with the SQL interface handled by psycopg2. I then developed this into a web-app by using Streamlit. This was then built as a Docker image and deployed as a web-app using Kubernetes and Terraform. I also worked to implement continuous integration principles to this project.",
            "image": {
                "path": "../images/2023-12-10_17-19.png",
                "alt": "an image showing a streamlit interface for making SQL queries."
            },
            "skills": ["Python", "Postgres", "Streamlit", "Docker", "Kubernetes", "Terraform", "Git", "GitHub"]
        },
        {
            "name": "Transport Dashboard",
            "url": "https://github.com/r-jeffery-wall/e_paper_transport_dashboard",
            "description": "This was a hobby project where I built a transport dashboard to show upcoming public transport departures using a Raspberry Pi Zero and an E-Paper display. Although not a full-stack app this project taught me a lot about APIs, and Python's requests library. Publishing my project on GitHub meant that I had to make sure that the code could be configured to individual use cases and was well-documented.",
            "image": {
                "path": "../images/transport_dashboard.jpg",
                "alt": "the transport dashboard, displaying upcoming departure information for four key stations in London."
            },
            "skills": ["Python", "Bash", "Git", "GitHub"]
        },
        {
            "name": "Mismatched Quote Generator",
            "url": "https://www.rowanjefferywall.com/Mismatched-Quote-Machine",
            "description": "This is a combination of two smaller projects of mine. When working through the FreeCodeCamp projects I made a React random quote machine. More recently I have also made a mismatched quote generator in native JavaScript as part of the Codecademy front-end course. By combining these two projects together I helped to refresh my React skills.",
            "image": {
                "path": "../images/mismatched_quotes.png",
                "alt": "A screenshot of the mismatched quotes generator web-app.  The quote reads: 'Genius is one percent inspiration and death and taxes.'"
            },
            "skills": ["JavaScript", "React", "HTML", "CSS"]
        },
        {
            "name": "Jamming",
            "url": "https://codecademy-jammming-lilac.vercel.app",
            "description": "This project was part of the Codecademy Full-Stack Web Developer Course. This web app uses React and the Spotify API to allow users to create playlists and save them to their account.",
            "image": {
                "path": "../images/jamming.png",
                "alt": "A screenshot showing the Jamming web app frontend.'"
            },
            "skills": ["JavaScript", "React", "HTML", "CSS", "Git", "GitHub"]
        },
        {
            "name": "Markdown Generator",
            "url": "https://codepen.io/rowjw/full/JjLmdYq",
            "description": "I built this markdown generator using a previous version of React as part of the FreeCodeCamp Front End Development Libraries Certification. Markdown entered on the left hand side of the screen will be rendered on the right.",
            "image": {
                "path": "../images/Screenshot from 2024-02-21 20-14-22.png",
                "alt": "A screenshot showing the markdown generator with some template markdown text.'"
            },
            "skills": ["JavaScript", "React", "HTML", "CSS", "Git", "GitHub"]
        },
        {
            "name": "React Calculator",
            "url": "https://codepen.io/rowjw/full/wvjEvro",
            "description": "This is a simple JavaScript calculator that uses React (a previous version). This project was part of the FreeCodeCamp Front End Development Libraries Certification.",
            "image": {
                "path": "../images/Screenshot from 2024-02-21 20-19-48.png",
                "alt": "A screenshot showing the calculator webapp.'"
            },
            "skills": ["JavaScript", "React", "HTML", "CSS", "Git", "GitHub"]
        }
    ],
    "socials": [
        {
            "name": "Email",
            "url": "mailto: rowjw97@gmail.com" 
        },
        {
            "name": "GitHub",
            "url": "https://github.com/r-jeffery-wall" 
        },
        {
            "name": "Instagram",
            "url": "https://www.instagram.com/rowphotojw/" 
        },
        {
            "name": "LinkedIn",
            "url": "https://www.linkedin.com/in/rowan-jeffery-wall-822260257/" 
        }
    ]
}